#+TITLE: Org 语法介绍

Org（Org mode）是一种用于笔记、写书、写稿、做幻灯片、管理任务的内置标记语言，文件扩展名为 =.org=。
官方手册：https://orgmode.org/zh-CN/quickstart.html

*** 源码块参数

=#+HEADER: :var x=10= 传参，=#+NAME:= 命名：

#+BEGIN_SRC python :var a=2 :var b=3
return a ** b
#+END_SRC

#+RESULTS: my-calc
: 8

#+NAME: my-calc
#+BEGIN_SRC python :var n=3
return n * n
#+END_SRC

